# -*- coding: utf-8 -*-
# -*- mode: org -*-
#+startup: beamer overview indent
#+LANGUAGE: pt-br
#+TAGS: noexport(n)
#+EXPORT_EXCLUDE_TAGS: noexport
#+EXPORT_SELECT_TAGS: export

#+Title: Revisão Aula 18
#+Subtitle: *INF01202*
#+Author: Prof. Lucas Mello Schnorr
#+Date: \copyleft

#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [xcolor=dvipsnames]
#+OPTIONS:   H:1 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+LATEX_HEADER: \input{org-babel.tex}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage{systeme}

* Configuração                                                     :noexport:

#+BEGIN_SRC emacs-lisp
(setq org-latex-listings 'minted
      org-latex-packages-alist '(("" "minted"))
      org-latex-pdf-process
      '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
(setq org-latex-minted-options
       '(("frame" "lines")
         ("fontsize" "\\scriptsize")))
#+END_SRC

#+RESULTS:
| frame    | lines       |
| fontsize | \scriptsize |
* Testes

#+begin_src shell :results output
gcc -Wall rev-a18-mult.c
echo "3 4 1 3 6 1 3 4 4 2 2 0 1 1 6 0.2 0.8 1.2 2.8" | ./a.out
#+end_src

#+RESULTS:
: Valor de r: Valor de s: Valor de t: Matriz A[0][0]: Matriz A[0][1]: Matriz A[0][2]: Matriz A[0][3]: Matriz A[1][0]: Matriz A[1][1]: Matriz A[1][2]: Matriz A[1][3]: Matriz A[2][0]: Matriz A[2][1]: Matriz A[2][2]: Matriz A[2][3]: Matriz B[0][0]: Matriz B[1][0]: Matriz B[2][0]: Matriz B[3][0]: 
: C
: 15.00 
: 12.00 
: 18.80 

Qual a receita mais barata?
- [ ] 1
- [ ] 2
- [ ] 3
